Terraform Plan for stage 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_domain.default[0] will be created
  + resource "digitalocean_domain" "default" {
      + id   = (known after apply)
      + name = "stage.microservices-demo.devopsbasics.systems"
      + ttl  = (known after apply)
      + urn  = (known after apply)
    }

  # digitalocean_project.environment[0] will be created
  + resource "digitalocean_project" "environment" {
      + created_at  = (known after apply)
      + description = "A project to represent Staging resources."
      + environment = "Staging"
      + id          = (known after apply)
      + is_default  = false
      + name        = "stage-shared-infra"
      + owner_id    = (known after apply)
      + owner_uuid  = (known after apply)
      + purpose     = "Web Application"
      + resources   = (known after apply)
      + updated_at  = (known after apply)
    }

  # digitalocean_project_resources.environment[0] will be created
  + resource "digitalocean_project_resources" "environment" {
      + id        = (known after apply)
      + project   = (known after apply)
      + resources = (known after apply)
    }

  # digitalocean_vpc.default[0] will be created
  + resource "digitalocean_vpc" "default" {
      + created_at = (known after apply)
      + default    = (known after apply)
      + id         = (known after apply)
      + ip_range   = (known after apply)
      + name       = "stage-shared-infra-vpc"
      + region     = "nyc3"
      + urn        = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @snegas, Env: `stage`*